haskell/UnitTest_Hunit.html
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Overview - HUnit functions and types</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The package HUnit provides unit testing facilities for Haskell. It is
inspired by JUnit tool for Java.
</p>

<p>
Documentation: <a href="http://hackage.haskell.org/package/HUnit">HUnit: A unit testing framework for Haskell</a>
</p>


<p>
<b>Install HUnit</b>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">$</span> stack install <span class="org-haskell-constructor">HUnit</span>
</pre>
</div>

<p>
<b>Assert Functions</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">Function</td>
<td class="left">&#xa0;</td>
<td class="left">Signature</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">assert</td>
<td class="left">::</td>
<td class="left">Assertable t =&gt; t -&gt; Assertion</td>
</tr>

<tr>
<td class="left">assertFailure</td>
<td class="left">::</td>
<td class="left">assertFailure :: String -&gt; Assertion</td>
</tr>

<tr>
<td class="left">assertBool</td>
<td class="left">::</td>
<td class="left">String -&gt; Bool -&gt; Assertion</td>
</tr>

<tr>
<td class="left">assertEqual</td>
<td class="left">::</td>
<td class="left">(Show a, Eq a) =&gt; String -&gt; a -&gt; a -&gt; Assertion</td>
</tr>

<tr>
<td class="left">assertionPredicate</td>
<td class="left">::</td>
<td class="left">AssertionPredicable t =&gt; t -&gt; AssertionPredicate</td>
</tr>

<tr>
<td class="left">assertString</td>
<td class="left">::</td>
<td class="left">String -&gt; Assertion</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
<b>Types</b>
</p>

<p>
Type <span class="underline">Assertion</span>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">type</span> <span class="org-haskell-type">Assertion</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
</pre>
</div>

<p>
Type: <span class="underline">Count</span>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Counts</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Counts</span> { cases, tried, errors, failures <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> }
              <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span>, <span class="org-haskell-constructor">Show</span>, <span class="org-haskell-constructor">Read</span>)
</pre>
</div>


<p>
Type: <span class="underline">Test</span> 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Test</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-constructor">Assertion</span>
          <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">TestList</span> [<span class="org-haskell-constructor">Test</span>]
          <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">TestLabel</span> <span class="org-haskell-constructor">String</span> <span class="org-haskell-constructor">Test</span>
</pre>
</div>

<p>
<b>Functions</b> 
</p>

<p>
<span class="underline">assertFailure</span> displays an error message. 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">assertFailure</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Assertion</span>
<span class="org-haskell-definition">assertFailure</span> msg <span class="org-haskell-operator">=</span> ioError (userError (<span class="org-string">"HUnit:"</span> <span class="org-haskell-operator">++</span> msg))
</pre>
</div>

<p>
Example: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">assertFailure</span> <span class="org-string">"It is going to fail. Fatal Kernel error ... error code 0x42343"</span> 
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">HUnitFailure</span> (<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Location</span> {locationFile <span class="org-haskell-operator">=</span> <span class="org-string">"&lt;interactive&gt;"</span>, locationLine <span class="org-haskell-operator">=</span> 4, locationColumn <span class="org-haskell-operator">=</span> 1})) 
<span class="org-string">"It is going to fail. Fatal Kernel error ... error code 0x42343"</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
<span class="underline">assertBool</span> shows an error message if the condition fails.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">assertBool</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Bool</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Assertion</span>
<span class="org-haskell-definition">assertBool</span> msg b <span class="org-haskell-operator">=</span> unless b (assertFailure msg)
</pre>
</div>

<p>
Example: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">assertBool</span> <span class="org-string">"It should be true"</span> <span class="org-haskell-constructor">True</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">assertBool</span> <span class="org-string">"It should be true"</span> <span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">HUnitFailure</span> (<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Location</span> {locationFile <span class="org-haskell-operator">=</span> <span class="org-string">"&lt;interactive&gt;"</span>, locationLine <span class="org-haskell-operator">=</span> 10, locationColumn <span class="org-haskell-operator">=</span> 1})) 
<span class="org-string">"It should be true"</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>


<p>
<span class="underline">assertString</span> shows an error message if the the input string is not empty.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">assertString</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Assertion</span>
<span class="org-haskell-definition">assertString</span> s <span class="org-haskell-operator">=</span> unless (null s) (assertFailure s)
</pre>
</div>

<p>
Example: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">assertString</span> <span class="org-string">"hello world"</span>
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">HUnitFailure</span> (<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Location</span> {locationFile <span class="org-haskell-operator">=</span> <span class="org-string">"&lt;interactive&gt;"</span>, locationLine <span class="org-haskell-operator">=</span> 19, locationColumn <span class="org-haskell-operator">=</span> 1}))
<span class="org-string">"hello world"</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">assertString</span> <span class="org-string">""</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
<span class="underline">assertEqual</span> shows  an error message if the input values are not equal. 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">assertEqual</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Eq</span> a, <span class="org-haskell-type">Show</span> a) <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Assertion</span>
<span class="org-haskell-definition">assertEqual</span> preface expected actual <span class="org-haskell-operator">=</span>
  unless (actual <span class="org-haskell-operator">==</span> expected) (assertFailure msg)
 <span class="org-haskell-keyword">where</span> msg <span class="org-haskell-operator">=</span> (<span class="org-haskell-keyword">if</span> null preface <span class="org-haskell-keyword">then</span> <span class="org-string">""</span> <span class="org-haskell-keyword">else</span> preface <span class="org-haskell-operator">++</span> <span class="org-string">"\n"</span>) <span class="org-haskell-operator">++</span>
             <span class="org-string">"expected: "</span> <span class="org-haskell-operator">++</span> show expected <span class="org-haskell-operator">++</span> <span class="org-string">"\n but got: "</span> <span class="org-haskell-operator">++</span> show actual
</pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">assertEqual</span> <span class="org-string">"10 + 15 should be equal to 25"</span> 25 (10 <span class="org-haskell-operator">+</span> 15)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">assertEqual</span> <span class="org-string">"10 + 15 should be equal to 35"</span> 35 (10 <span class="org-haskell-operator">+</span> 15)
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">HUnitFailure</span> (<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Location</span> {locationFile <span class="org-haskell-operator">=</span> <span class="org-string">"&lt;interactive&gt;"</span>, locationLine <span class="org-haskell-operator">=</span> 17, locationColumn <span class="org-haskell-operator">=</span> 1}))
<span class="org-string">"10 + 15 should be equal to 35\nexpected: 35\n but got: 25"</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
<b>Run the test cases</b> 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t runTestTT
<span class="org-function-name">runTestTT</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Test</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">Counts</span>
</pre>
</div>

<p>
Type Test 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Test</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-constructor">Assertion</span>
          <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">TestList</span> [<span class="org-haskell-constructor">Test</span>]
          <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">TestLabel</span> <span class="org-haskell-constructor">String</span> <span class="org-haskell-constructor">Test</span>
</pre>
</div>

<p>
Example: Running a single test
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runTestTT</span> (<span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-operator">$</span> assertEqual <span class="org-string">"sum should be equal to 25"</span> 25 (10 <span class="org-haskell-operator">+</span> 15))
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 1  <span class="org-haskell-constructor">Tried:</span> 1  <span class="org-haskell-constructor">Errors:</span> 0  <span class="org-haskell-constructor">Failures:</span> 0
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 1, tried <span class="org-haskell-operator">=</span> 1, errors <span class="org-haskell-operator">=</span> 0, failures <span class="org-haskell-operator">=</span> 0}
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runTestTT</span> (<span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-operator">$</span> assertEqual <span class="org-string">"sum should be equal to 25"</span> 25 (50 <span class="org-haskell-operator">+</span> 15))
<span class="org-preprocessor">### Failure:                              </span>
<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>161
<span class="org-haskell-definition">sum</span> should be equal to 25
<span class="org-function-name">expected</span><span class="org-haskell-definition">:</span> 25
 but got<span class="org-haskell-constructor">:</span> 65
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 1  <span class="org-haskell-constructor">Tried:</span> 1  <span class="org-haskell-constructor">Errors:</span> 0  <span class="org-haskell-constructor">Failures:</span> 1
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 1, tried <span class="org-haskell-operator">=</span> 1, errors <span class="org-haskell-operator">=</span> 0, failures <span class="org-haskell-operator">=</span> 1}
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Example: Running a single test with label 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> testEqual25 <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testEqual25"</span> (<span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-operator">$</span> assertEqual <span class="org-string">"sum should be equal to 25"</span> 25 (10 <span class="org-haskell-operator">+</span> 15))
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runTestTT</span> testEqual25 
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 1  <span class="org-haskell-constructor">Tried:</span> 1  <span class="org-haskell-constructor">Errors:</span> 0  <span class="org-haskell-constructor">Failures:</span> 0
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 1, tried <span class="org-haskell-operator">=</span> 1, errors <span class="org-haskell-operator">=</span> 0, failures <span class="org-haskell-operator">=</span> 0}
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> testEqual25_2 <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testEqual25"</span> (<span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-operator">$</span> assertEqual <span class="org-string">"sum should be equal to 25"</span> 25 (20 <span class="org-haskell-operator">+</span> 15))
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> testEqual25_2 
<span class="org-haskell-constructor">TestLabel</span> testEqual25 <span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-keyword">_</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runTestTT</span> testEqual25_2 
<span class="org-preprocessor">### Failure in: testEqual25               </span>
<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>153
<span class="org-haskell-definition">sum</span> should be equal to 25
<span class="org-function-name">expected</span><span class="org-haskell-definition">:</span> 25
 but got<span class="org-haskell-constructor">:</span> 35
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 1  <span class="org-haskell-constructor">Tried:</span> 1  <span class="org-haskell-constructor">Errors:</span> 0  <span class="org-haskell-constructor">Failures:</span> 1
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 1, tried <span class="org-haskell-operator">=</span> 1, errors <span class="org-haskell-operator">=</span> 0, failures <span class="org-haskell-operator">=</span> 1}
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Example: Running multiple test cases. 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> testTrue <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-operator">$</span> assertBool <span class="org-string">"It should be true"</span> <span class="org-haskell-constructor">True</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> testFalse <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-operator">$</span> assertBool <span class="org-string">"It is gonna fail."</span> <span class="org-haskell-constructor">False</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> testEqual25 <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-operator">$</span> assertEqual <span class="org-string">"The sum should be equal to 25"</span> 25 (10 <span class="org-haskell-operator">+</span> 15)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> testEqual25Fail <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-operator">$</span> assertEqual <span class="org-string">"The sum should be equal to 25"</span> 25 (150 <span class="org-haskell-operator">+</span> 25)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> runTestTT <span class="org-haskell-definition">$</span> <span class="org-haskell-constructor">TestList</span> [testTrue, testFalse, testEqual25, testEqual25Fail]
<span class="org-preprocessor">### Failure in: 1                         </span>
<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>164
<span class="org-haskell-constructor">It</span> is gonna fail<span class="org-haskell-operator">.</span>
<span class="org-preprocessor">### Failure in: 3                         </span>
<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>166
<span class="org-haskell-constructor">The</span> sum should be equal to 25
<span class="org-function-name">expected</span><span class="org-haskell-definition">:</span> 25
 but got<span class="org-haskell-constructor">:</span> 175
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 4  <span class="org-haskell-constructor">Tried:</span> 4  <span class="org-haskell-constructor">Errors:</span> 0  <span class="org-haskell-constructor">Failures:</span> 2
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 4, tried <span class="org-haskell-operator">=</span> 4, errors <span class="org-haskell-operator">=</span> 0, failures <span class="org-haskell-operator">=</span> 2}
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-constructor">:</span>{
runTestTT <span class="org-haskell-definition">$</span> <span class="org-haskell-constructor">TestList</span> [<span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testTrue"</span> testTrue,
                      <span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testFalse"</span> testFalse,
                      <span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testEqual25"</span> testEqual25,
                      <span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testEqual25Fail"</span> testEqual25Fail
                     ]
<span class="org-haskell-constructor">:</span>}

<span class="org-comment-delimiter">-- </span><span class="org-comment">Pasting this code in the terminal:</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>{
<span class="org-haskell-operator">-</span> runTestTT <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">TestList</span> [<span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testTrue"</span> testTrue,
<span class="org-haskell-operator">-</span>                       <span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testFalse"</span> testFalse,
<span class="org-haskell-operator">-</span>                       <span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testEqual25"</span> testEqual25,
<span class="org-haskell-operator">-</span>                       <span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testEqual25Fail"</span> testEqual25Fail
<span class="org-haskell-operator">-</span>                      ]
<span class="org-function-name">-</span> <span class="org-haskell-constructor">:</span>}
<span class="org-preprocessor">### Failure in: 1:testFalse               </span>
<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>164
<span class="org-haskell-constructor">It</span> is gonna fail<span class="org-haskell-operator">.</span>

<span class="org-preprocessor">### Failure in: 3:testEqual25Fail         </span>
<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>166
<span class="org-haskell-constructor">The</span> sum should be equal to 25
<span class="org-function-name">expected</span><span class="org-haskell-definition">:</span> 25
 but got<span class="org-haskell-constructor">:</span> 175
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 4  <span class="org-haskell-constructor">Tried:</span> 4  <span class="org-haskell-constructor">Errors:</span> 0  <span class="org-haskell-constructor">Failures:</span> 2
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 4, tried <span class="org-haskell-operator">=</span> 4, errors <span class="org-haskell-operator">=</span> 0, failures <span class="org-haskell-operator">=</span> 2}
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>


<p>
<b>Operators</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Description</th>
<th scope="col" class="left">Operator</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Signature</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Assert Bool (True)</td>
<td class="left">(@?)</td>
<td class="left">::</td>
<td class="left">(AssertionPredicable t) =&gt; t -&gt; String -&gt; Assertion</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Assert Equal</td>
<td class="left">(@=?)</td>
<td class="left">::</td>
<td class="left">(Show a, Eq a) =&gt; a: expected -&gt; a: value -&gt; Assertion</td>
</tr>

<tr>
<td class="left">Assert Equal</td>
<td class="left">(@?=)</td>
<td class="left">::</td>
<td class="left">(Eq a, Show a) =&gt; a: value    -&gt; a: expected -&gt; Assertion</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Creates test case with label</td>
<td class="left">(~:)</td>
<td class="left">::</td>
<td class="left">Testable t =&gt; String -&gt; t -&gt; Test</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Creates an equality test case</td>
<td class="left">(~?=)</td>
<td class="left">::</td>
<td class="left">(Show a, Eq a) =&gt; a: value    -&gt; a: expected -&gt; Test</td>
</tr>

<tr>
<td class="left">Creates an equality test case</td>
<td class="left">(~=?)</td>
<td class="left">::</td>
<td class="left">(Show a, Eq a) =&gt; a: expected -&gt; a: value    -&gt; Test</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Example: (@=?)
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t (<span class="org-haskell-operator">@=?</span>)
(<span class="org-haskell-definition">@=?</span>) <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Show</span> a, <span class="org-haskell-type">Eq</span> a) <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Assertion</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> 10 <span class="org-haskell-operator">@=?</span> (1 <span class="org-haskell-operator">+</span> 2 <span class="org-haskell-operator">+</span> 3 <span class="org-haskell-operator">+</span> 4)
<span class="org-haskell-operator">&gt;</span> 10 <span class="org-haskell-operator">@=?</span> (1 <span class="org-haskell-operator">+</span> 2 <span class="org-haskell-operator">+</span> 3 <span class="org-haskell-operator">+</span> 4 <span class="org-haskell-operator">+</span> 5)
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> <span class="org-haskell-type">HUnitFailure</span> (<span class="org-haskell-type">Just</span> (<span class="org-haskell-type">Location</span> {locationFile <span class="org-haskell-operator">=</span> <span class="org-string">"&lt;interactive&gt;"</span>, locationLine <span class="org-haskell-operator">=</span> 46, locationColumn <span class="org-haskell-operator">=</span> 1})) <span class="org-string">"expected: 10\n but got: 15"</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> 120 <span class="org-haskell-operator">@=?</span> product [1, 2, 3, 4, 5]
<span class="org-haskell-operator">&gt;</span> 120 <span class="org-haskell-operator">@=?</span> product [1, 2, 3, 4, 5, 6]
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">HUnitFailure</span> (<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Location</span> {locationFile <span class="org-haskell-operator">=</span> <span class="org-string">"&lt;interactive&gt;"</span>, locationLine <span class="org-haskell-operator">=</span> 58, locationColumn <span class="org-haskell-operator">=</span> 1})) <span class="org-string">"expected: 120\n but got: 720"</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Example: (@?) 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> 100 <span class="org-haskell-operator">&gt;</span> 10 <span class="org-haskell-operator">@?</span> <span class="org-string">"It should be true"</span> 

<span class="org-haskell-operator">&gt;</span> 100 <span class="org-haskell-operator">&lt;</span> 10 <span class="org-haskell-operator">@?</span> <span class="org-string">"It should be true"</span> 
 <span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">HUnitFailure</span> (<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Location</span> {locationFile <span class="org-haskell-operator">=</span> <span class="org-string">"&lt;interactive&gt;"</span>, locationLine <span class="org-haskell-operator">=</span> 286, locationColumn <span class="org-haskell-operator">=</span> 1})) <span class="org-string">"It should be true"</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Example: (~:) 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t (<span class="org-haskell-operator">~:</span>)
(<span class="org-haskell-definition">~:</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Testable</span> t <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> t <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Test</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> test1 <span class="org-haskell-operator">=</span> <span class="org-string">"testSumIs25"</span> <span class="org-haskell-operator">~:</span> assertEqual <span class="org-string">"The sum is 25"</span> 25 (10 <span class="org-haskell-operator">+</span> 15)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runTestTT</span> test1
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 1  <span class="org-haskell-constructor">Tried:</span> 1  <span class="org-haskell-constructor">Errors:</span> 0  <span class="org-haskell-constructor">Failures:</span> 0
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 1, tried <span class="org-haskell-operator">=</span> 1, errors <span class="org-haskell-operator">=</span> 0, failures <span class="org-haskell-operator">=</span> 0}
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> test2 <span class="org-haskell-operator">=</span> <span class="org-string">"testSumIs25"</span> <span class="org-haskell-operator">~:</span> assertEqual <span class="org-string">"The sum is 25"</span> 25 (13 <span class="org-haskell-operator">+</span> 15)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runTestTT</span> test2
<span class="org-preprocessor">### Failure in: testSumIs25               </span>
<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>223
<span class="org-haskell-constructor">The</span> sum is 25
<span class="org-function-name">expected</span><span class="org-haskell-definition">:</span> 25
 but got<span class="org-haskell-constructor">:</span> 28
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 1  <span class="org-haskell-constructor">Tried:</span> 1  <span class="org-haskell-constructor">Errors:</span> 0  <span class="org-haskell-constructor">Failures:</span> 1
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 1, tried <span class="org-haskell-operator">=</span> 1, errors <span class="org-haskell-operator">=</span> 0, failures <span class="org-haskell-operator">=</span> 1}
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> test3 <span class="org-haskell-operator">=</span> <span class="org-string">"testSumIs25"</span> <span class="org-haskell-operator">~:</span>  25 <span class="org-haskell-operator">@=?</span> (10 <span class="org-haskell-operator">+</span> 15)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runTestTT</span> test3
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 1  <span class="org-haskell-constructor">Tried:</span> 1  <span class="org-haskell-constructor">Errors:</span> 0  <span class="org-haskell-constructor">Failures:</span> 0
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 1, tried <span class="org-haskell-operator">=</span> 1, errors <span class="org-haskell-operator">=</span> 0, failures <span class="org-haskell-operator">=</span> 0}
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> test4 <span class="org-haskell-operator">=</span> <span class="org-string">"testSumIs25"</span> <span class="org-haskell-operator">~:</span>  25 <span class="org-haskell-operator">@=?</span> (1023 <span class="org-haskell-operator">+</span> 15)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runTestTT</span> test4
<span class="org-preprocessor">### Failure in: testSumIs25               </span>
<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>234
<span class="org-function-name">expected</span><span class="org-haskell-definition">:</span> 25
 but got<span class="org-haskell-constructor">:</span> 1038
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 1  <span class="org-haskell-constructor">Tried:</span> 1  <span class="org-haskell-constructor">Errors:</span> 0  <span class="org-haskell-constructor">Failures:</span> 1
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 1, tried <span class="org-haskell-operator">=</span> 1, errors <span class="org-haskell-operator">=</span> 0, failures <span class="org-haskell-operator">=</span> 1}
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Example: (~?=) 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> runTestTT <span class="org-haskell-definition">$</span> 20 <span class="org-haskell-operator">~?=</span> 20
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 1  <span class="org-haskell-constructor">Tried:</span> 1  <span class="org-haskell-constructor">Errors:</span> 0  <span class="org-haskell-constructor">Failures:</span> 0
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 1, tried <span class="org-haskell-operator">=</span> 1, errors <span class="org-haskell-operator">=</span> 0, failures <span class="org-haskell-operator">=</span> 0}
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> runTestTT <span class="org-haskell-definition">$</span> 10 <span class="org-haskell-operator">~?=</span> 20
<span class="org-preprocessor">### Failure:                              </span>
<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>276
<span class="org-function-name">expected</span><span class="org-haskell-definition">:</span> 20
 but got<span class="org-haskell-constructor">:</span> 10
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 1  <span class="org-haskell-constructor">Tried:</span> 1  <span class="org-haskell-constructor">Errors:</span> 0  <span class="org-haskell-constructor">Failures:</span> 1
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 1, tried <span class="org-haskell-operator">=</span> 1, errors <span class="org-haskell-operator">=</span> 0, failures <span class="org-haskell-operator">=</span> 1}
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Example: (~=?)
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> runTestTT <span class="org-haskell-definition">$</span> 10 <span class="org-haskell-operator">~=?</span> 20
<span class="org-preprocessor">### Failure:                              </span>
<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>281
<span class="org-function-name">expected</span><span class="org-haskell-definition">:</span> 10
 but got<span class="org-haskell-constructor">:</span> 20
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 1  <span class="org-haskell-constructor">Tried:</span> 1  <span class="org-haskell-constructor">Errors:</span> 0  <span class="org-haskell-constructor">Failures:</span> 1
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 1, tried <span class="org-haskell-operator">=</span> 1, errors <span class="org-haskell-operator">=</span> 0, failures <span class="org-haskell-operator">=</span> 1}
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> runTestTT <span class="org-haskell-definition">$</span> 20 <span class="org-haskell-operator">~=?</span> 20
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 1  <span class="org-haskell-constructor">Tried:</span> 1  <span class="org-haskell-constructor">Errors:</span> 0  <span class="org-haskell-constructor">Failures:</span> 0
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 1, tried <span class="org-haskell-operator">=</span> 1, errors <span class="org-haskell-operator">=</span> 0, failures <span class="org-haskell-operator">=</span> 0}
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Test.HUnit</span>
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">System.IO</span>

<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">fact</span> 1 <span class="org-haskell-operator">=</span> 1
<span class="org-haskell-definition">fact</span> n <span class="org-haskell-operator">=</span> n <span class="org-haskell-operator">*</span> fact (n <span class="org-haskell-operator">-</span> 1)
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">tests</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestList</span>
    [ <span class="org-string">"fact 1"</span> <span class="org-haskell-operator">~:</span> fact 1 <span class="org-haskell-operator">~?=</span> 1
    , <span class="org-string">"fact 2"</span> <span class="org-haskell-operator">~:</span> fact 2 <span class="org-haskell-operator">~?=</span> 2
    , <span class="org-string">"fact 3"</span> <span class="org-haskell-operator">~:</span> fact 3 <span class="org-haskell-operator">~?=</span> 6
    , <span class="org-string">"fact 4"</span> <span class="org-haskell-operator">~:</span> fact 4 <span class="org-haskell-operator">~?=</span> 24
    , <span class="org-string">"fact 5"</span> <span class="org-haskell-operator">~:</span> fact 5 <span class="org-haskell-operator">~?=</span> 120
    ]
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runTestTT</span> tests
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 5  <span class="org-haskell-constructor">Tried:</span> 5  <span class="org-haskell-constructor">Errors:</span> 0  <span class="org-haskell-constructor">Failures:</span> 0
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 5, tried <span class="org-haskell-operator">=</span> 5, errors <span class="org-haskell-operator">=</span> 0, failures <span class="org-haskell-operator">=</span> 0}
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
