haskell/UnitTest_Hunit.org
** HUnit in the REPL

Example using =$ stack ghci=

#+BEGIN_SRC haskell 
  > import Test.HUnit
  > 

  > :info Counts
  data Counts
    = Counts {cases :: Int,
              tried :: Int,
              errors :: Int,
              failures :: Int}
          -- Defined in ‘Test.HUnit.Base’
  instance [safe] Eq Counts -- Defined in ‘Test.HUnit.Base’
  instance [safe] Read Counts -- Defined in ‘Test.HUnit.Base’
  instance [safe] Show Counts -- Defined in ‘Test.HUnit.Base’
  > 

  > :info TestCase
  data Test = TestCase Assertion | ...
          -- Defined in ‘Test.HUnit.Base’

  > :t TestCase 
  TestCase :: Assertion -> Test


  > :info Assertion
  type Assertion = IO ()  -- Defined in ‘Test.HUnit.Lang’
  > 

  > 
  > :{
  - addInt :: Int -> Int -> Int 
  - addInt x y = x + y
  - :}
  > 
  > addInt 10 20
  30
  > 
  > import Test.HUnit
  > 
  > :t TestCase
  TestCase :: Assertion -> Test
  > 
  > assertEqual "add 2 10 should be 12" 12 (add 10 2)
  > 
  > assertEqual "add 2 10 should be 12" 0 (add 10 2)
  ,*** Exception: HUnitFailure (Just (Location {locationFile = "<interactive>", locationLine = 23, locationColumn = 1})) 
  "add 2 10 should be 12\nexpected: 0.0\n but got: 12.0"
  >

  > assertBool "It should be true" True
  > assertBool "It should be true" False
  ,*** Exception: HUnitFailure (Just (Location {locationFile = "<interactive>", locationLine = 50, locationColumn = 1})) 
  "It should be true"
  > 
  >

  > assertBool "It should be true" (10 > 5)
  > assertBool "It should be true" (10 < 5)
  ,*** Exception: HUnitFailure (Just (Location {locationFile = "<interactive>", locationLine = 54, locationColumn = 1})) 
  "It should be true"
  > 
   

  :{
  testFile filename msg = do 
    writeFile filename msg
    content <- readFile filename
    assertEqual ("File content should be equal to \"" ++ msg ++ "\"") msg content
  :}

  > testFile "/tmp/testfile1" "hello world"
  > 

  :{
  testFile2 filename msg msgExpect = do 
    writeFile filename msg
    content <- readFile filename
    assertEqual ("File content should be equal to \"" ++ msg ++ "\"") msgExpect content
  :}

  > testFile2 "/tmp/testfile2" "hello world" "hello world"

  > testFile2 "/tmp/testfile2" "hello world" "hello"
  ,*** Exception: HUnitFailure (Just (Location {locationFile = "<interactive>", locationLine = 90, locationColumn = 3})) 
  "File content should be equal to \"hello world\"\nexpected: \"hello\"\n but got: \"hello world\""
  >

  > testFile2 "/afile.txt" "hello" "hello"
   ,*** Exception: /afile.txt: openFile: permission denied (Permission denied)
  > 

  > runTestTT $ TestCase $ testFile2 "/afile.txt" "hello" "hello"
  ### Error:                                
  /afile.txt: openFile: permission denied (Permission denied)
  Cases: 1  Tried: 1  Errors: 1  Failures: 0
  Counts {cases = 1, tried = 1, errors = 1, failures = 0}
  > 

    

  > import Text.Read (readMaybe)
  >  
  > assertEqual "The parsed string should be equal to 100" (Just 100) ((readMaybe "100") :: Maybe Int)
  > 
  > assertEqual "The parsed string should be equal to 100" (Just 100) ((readMaybe "1asd00") :: Maybe Int)
  ,*** Exception: HUnitFailure (Just (Location {locationFile = "<interactive>", locationLine = 115, locationColumn = 1})) 
  "The parsed string should be equal to 100\nexpected: Just 100\n but got: Nothing"
  > 
       
    
    
  > let testSum = TestCase $ assertEqual "10 + 5 = 15" 15 (10 + 5)
  > let testProd = TestCase $ assertEqual "10 * 15" 150 (10 * 15)
  > let testPred = TestCase $ assertBool "10 > 5" (10 > 5)
  >

  > let testFailure = TestCase $ assertEqual "It will fail 10 + 2 = 15" (10 + 2) 15  
    
  :{  
  testlist = TestList [TestLabel "testSum" testSum,
                       TestLabel "testPred" testPred,
                       TestLabel "testFailure" testFailure,
                       TestLabel "testProd" testProd                    
                      ]
    
  :}

  > runTestTT testlist
  ### Failure in: 2:testFailure             
  <interactive>:94
  It will fail 10 + 2 = 15
  expected: 12
   but got: 15
  Cases: 4  Tried: 4  Errors: 0  Failures: 1
  Counts {cases = 4, tried = 4, errors = 0, failures = 1}
  > 

  :{  
  testlist2 = TestList [TestLabel "testSum" testSum,
                        TestLabel "testPred" testPred,
                        -- TestLabel "testFailure" testFailure,
                        TestLabel "testProd" testProd                    
                       ]
   
  :}  


  > runTestTT testlist2
  Cases: 3  Tried: 3  Errors: 0  Failures: 0
  Counts {cases = 3, tried = 3, errors = 0, failures = 0}
  > 

#+END_SRC

