haskell/UnitTest_Hunit.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> HUnit in the REPL</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Example using <code>$ stack ghci</code>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Test.HUnit</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>info <span class="org-haskell-constructor">Counts</span>
<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Counts</span>
  <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>,
            tried <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>,
            errors <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>,
            failures <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>}
        <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Test.HUnit.Base&#8217;</span>
<span class="org-haskell-keyword">instance</span> [safe] <span class="org-haskell-type">Eq</span> <span class="org-haskell-type">Counts</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Test.HUnit.Base&#8217;</span>
<span class="org-haskell-keyword">instance</span> [safe] <span class="org-haskell-type">Read</span> <span class="org-haskell-type">Counts</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Test.HUnit.Base&#8217;</span>
<span class="org-haskell-keyword">instance</span> [safe] <span class="org-haskell-type">Show</span> <span class="org-haskell-type">Counts</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Test.HUnit.Base&#8217;</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>info <span class="org-haskell-type">TestCase</span>
<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Test</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-constructor">Assertion</span> <span class="org-haskell-operator">|</span> <span class="org-haskell-operator">...</span>
        <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Test.HUnit.Base&#8217;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t <span class="org-haskell-constructor">TestCase</span> 
<span class="org-function-name">TestCase</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Assertion</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Test</span>


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>info <span class="org-haskell-type">Assertion</span>
<span class="org-haskell-keyword">type</span> <span class="org-haskell-type">Assertion</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>  <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Test.HUnit.Lang&#8217;</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>{
<span class="org-haskell-operator">-</span> addInt <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span> 
<span class="org-haskell-operator">-</span> addInt x y <span class="org-haskell-operator">=</span> x <span class="org-haskell-operator">+</span> y
<span class="org-function-name">-</span> <span class="org-haskell-type">:</span>}
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">addInt</span> 10 20
30
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Test.HUnit</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t <span class="org-haskell-constructor">TestCase</span>
<span class="org-function-name">TestCase</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Assertion</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Test</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">assertEqual</span> <span class="org-string">"add 2 10 should be 12"</span> 12 (add 10 2)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">assertEqual</span> <span class="org-string">"add 2 10 should be 12"</span> 0 (add 10 2)
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> <span class="org-haskell-type">HUnitFailure</span> (<span class="org-haskell-type">Just</span> (<span class="org-haskell-type">Location</span> {locationFile <span class="org-haskell-operator">=</span> <span class="org-string">"&lt;interactive&gt;"</span>, locationLine <span class="org-haskell-operator">=</span> 23, locationColumn <span class="org-haskell-operator">=</span> 1})) 
<span class="org-string">"add 2 10 should be 12\nexpected: 0.0\n but got: 12.0"</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">assertBool</span> <span class="org-string">"It should be true"</span> <span class="org-haskell-constructor">True</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">assertBool</span> <span class="org-string">"It should be true"</span> <span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">HUnitFailure</span> (<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Location</span> {locationFile <span class="org-haskell-operator">=</span> <span class="org-string">"&lt;interactive&gt;"</span>, locationLine <span class="org-haskell-operator">=</span> 50, locationColumn <span class="org-haskell-operator">=</span> 1})) 
<span class="org-string">"It should be true"</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">assertBool</span> <span class="org-string">"It should be true"</span> (10 <span class="org-haskell-operator">&gt;</span> 5)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">assertBool</span> <span class="org-string">"It should be true"</span> (10 <span class="org-haskell-operator">&lt;</span> 5)
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">HUnitFailure</span> (<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Location</span> {locationFile <span class="org-haskell-operator">=</span> <span class="org-string">"&lt;interactive&gt;"</span>, locationLine <span class="org-haskell-operator">=</span> 54, locationColumn <span class="org-haskell-operator">=</span> 1})) 
<span class="org-string">"It should be true"</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">testFile</span> filename msg <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span> 
  writeFile filename msg
  content <span class="org-haskell-operator">&lt;-</span> readFile filename
  assertEqual (<span class="org-string">"File content should be equal to \""</span> <span class="org-haskell-operator">++</span> msg <span class="org-haskell-operator">++</span> <span class="org-string">"\""</span>) msg content
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testFile</span> <span class="org-string">"/tmp/testfile1"</span> <span class="org-string">"hello world"</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">testFile2</span> filename msg msgExpect <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span> 
  writeFile filename msg
  content <span class="org-haskell-operator">&lt;-</span> readFile filename
  assertEqual (<span class="org-string">"File content should be equal to \""</span> <span class="org-haskell-operator">++</span> msg <span class="org-haskell-operator">++</span> <span class="org-string">"\""</span>) msgExpect content
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testFile2</span> <span class="org-string">"/tmp/testfile2"</span> <span class="org-string">"hello world"</span> <span class="org-string">"hello world"</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testFile2</span> <span class="org-string">"/tmp/testfile2"</span> <span class="org-string">"hello world"</span> <span class="org-string">"hello"</span>
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">HUnitFailure</span> (<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Location</span> {locationFile <span class="org-haskell-operator">=</span> <span class="org-string">"&lt;interactive&gt;"</span>, locationLine <span class="org-haskell-operator">=</span> 90, locationColumn <span class="org-haskell-operator">=</span> 3})) 
<span class="org-string">"File content should be equal to \"hello world\"\nexpected: \"hello\"\n but got: \"hello world\""</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testFile2</span> <span class="org-string">"/afile.txt"</span> <span class="org-string">"hello"</span> <span class="org-string">"hello"</span>
 <span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-operator">/</span>afile<span class="org-haskell-operator">.</span>txt<span class="org-haskell-constructor">:</span> openFile<span class="org-haskell-constructor">:</span> permission denied (<span class="org-haskell-constructor">Permission</span> denied)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> runTestTT <span class="org-haskell-definition">$</span> <span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-operator">$</span> testFile2 <span class="org-string">"/afile.txt"</span> <span class="org-string">"hello"</span> <span class="org-string">"hello"</span>
<span class="org-preprocessor">### Error:                                </span>
<span class="org-function-name">/afile.txt</span><span class="org-haskell-constructor">:</span> openFile<span class="org-haskell-constructor">:</span> permission denied (<span class="org-haskell-constructor">Permission</span> denied)
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 1  <span class="org-haskell-constructor">Tried:</span> 1  <span class="org-haskell-constructor">Errors:</span> 1  <span class="org-haskell-constructor">Failures:</span> 0
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 1, tried <span class="org-haskell-operator">=</span> 1, errors <span class="org-haskell-operator">=</span> 1, failures <span class="org-haskell-operator">=</span> 0}
<span class="org-haskell-operator">&gt;</span> 



<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Read</span> (readMaybe)
<span class="org-haskell-operator">&gt;</span>  
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">assertEqual</span> <span class="org-string">"The parsed string should be equal to 100"</span> (<span class="org-haskell-constructor">Just</span> 100) ((readMaybe <span class="org-string">"100"</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">Int</span>)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">assertEqual</span> <span class="org-string">"The parsed string should be equal to 100"</span> (<span class="org-haskell-constructor">Just</span> 100) ((readMaybe <span class="org-string">"1asd00"</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">Int</span>)
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">HUnitFailure</span> (<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Location</span> {locationFile <span class="org-haskell-operator">=</span> <span class="org-string">"&lt;interactive&gt;"</span>, locationLine <span class="org-haskell-operator">=</span> 115, locationColumn <span class="org-haskell-operator">=</span> 1})) 
<span class="org-string">"The parsed string should be equal to 100\nexpected: Just 100\n but got: Nothing"</span>
<span class="org-haskell-operator">&gt;</span> 



<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> testSum <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-operator">$</span> assertEqual <span class="org-string">"10 + 5 = 15"</span> 15 (10 <span class="org-haskell-operator">+</span> 5)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> testProd <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-operator">$</span> assertEqual <span class="org-string">"10 * 15"</span> 150 (10 <span class="org-haskell-operator">*</span> 15)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> testPred <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-operator">$</span> assertBool <span class="org-string">"10 &gt; 5"</span> (10 <span class="org-haskell-operator">&gt;</span> 5)
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> testFailure <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-operator">$</span> assertEqual <span class="org-string">"It will fail 10 + 2 = 15"</span> (10 <span class="org-haskell-operator">+</span> 2) 15  

<span class="org-haskell-constructor">:</span>{  
<span class="org-haskell-definition">testlist</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestList</span> [<span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testSum"</span> testSum,
                     <span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testPred"</span> testPred,
                     <span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testFailure"</span> testFailure,
                     <span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testProd"</span> testProd                    
                    ]

<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runTestTT</span> testlist
<span class="org-preprocessor">### Failure in: 2:testFailure             </span>
<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>94
<span class="org-haskell-constructor">It</span> will fail 10 <span class="org-haskell-operator">+</span> 2 <span class="org-haskell-operator">=</span> 15
<span class="org-function-name">expected</span><span class="org-haskell-definition">:</span> 12
 but got<span class="org-haskell-constructor">:</span> 15
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 4  <span class="org-haskell-constructor">Tried:</span> 4  <span class="org-haskell-constructor">Errors:</span> 0  <span class="org-haskell-constructor">Failures:</span> 1
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 4, tried <span class="org-haskell-operator">=</span> 4, errors <span class="org-haskell-operator">=</span> 0, failures <span class="org-haskell-operator">=</span> 1}
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-constructor">:</span>{  
<span class="org-haskell-definition">testlist2</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestList</span> [<span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testSum"</span> testSum,
                      <span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testPred"</span> testPred,
                      <span class="org-comment-delimiter">-- </span><span class="org-comment">TestLabel "testFailure" testFailure,</span>
                      <span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testProd"</span> testProd                    
                     ]

<span class="org-haskell-constructor">:</span>}  


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runTestTT</span> testlist2
<span class="org-function-name">Cases</span><span class="org-haskell-definition">:</span> 3  <span class="org-haskell-constructor">Tried:</span> 3  <span class="org-haskell-constructor">Errors:</span> 0  <span class="org-haskell-constructor">Failures:</span> 0
<span class="org-haskell-constructor">Counts</span> {cases <span class="org-haskell-operator">=</span> 3, tried <span class="org-haskell-operator">=</span> 3, errors <span class="org-haskell-operator">=</span> 0, failures <span class="org-haskell-operator">=</span> 0}
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
