haskell/UnitTest_Hunit.html

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Example: Unit test with HUnit</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">-- </span><span class="org-comment">File: unitTestExample.hs</span>

<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Test.HUnit</span>

<span class="org-haskell-definition">testSum</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-operator">$</span> assertEqual <span class="org-string">"10 + 5 = 15"</span> 15 (10 <span class="org-haskell-operator">+</span> 5)

<span class="org-haskell-definition">testProd</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-operator">$</span> assertEqual <span class="org-string">"10 * 15"</span> 150 (10 <span class="org-haskell-operator">*</span> 15)

<span class="org-haskell-definition">testPred</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-operator">$</span> assertBool <span class="org-string">"10 &gt; 5"</span> (10 <span class="org-haskell-operator">&gt;</span> 5)

<span class="org-haskell-definition">testFailure</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestCase</span> <span class="org-haskell-operator">$</span> assertEqual <span class="org-string">"It will fail 10 + 2 = 15"</span> (10 <span class="org-haskell-operator">+</span> 2) 15  

<span class="org-haskell-definition">testlist</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TestList</span> [<span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testSum"</span> testSum,
                     <span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testPred"</span> testPred,
                     <span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testFailure"</span> testFailure,
                     <span class="org-haskell-constructor">TestLabel</span> <span class="org-string">"testProd"</span> testProd                    
                    ]

<span class="org-function-name">main</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">main</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  runTestTT testlist
  return <span class="org-haskell-constructor">()</span>
</pre>
</div>

<p>
<b>Running the tests</b> 
</p>

<p>
Run the test as a script with runhaskell: 
</p>

<div class="org-src-container">

<pre class="src src-sh">$ stack exec -- runhaskell /tmp/uniTestExample.hs 
<span class="org-comment-delimiter">### </span><span class="org-comment">Failure in: 2:testFailure             </span>
<span class="org-function-name">/tmp/uniTestExample.hs</span>:12
It will fail 10 + 2 = 15
<span class="org-function-name">expected</span>: 12
 but got: 15
<span class="org-function-name">Cases</span>: 4  Tried: 4  Errors: 0  Failures: 1
</pre>
</div>

<p>
Run the test compiling:
</p>

<div class="org-src-container">

<pre class="src src-sh">$ stack exec -- ghc --make /tmp/uniTestExample.hs 
[1 of 1] Compiling Main             ( /tmp/uniTestExample.hs, /tmp/uniTestExample.o )
Linking /tmp/uniTestExample ..

$ /tmp/uniTestExample
<span class="org-comment-delimiter">### </span><span class="org-comment">Failure in: 2:testFailure             </span>
<span class="org-function-name">/tmp/uniTestExample.hs</span>:12
It will fail 10 + 2 = 15
<span class="org-function-name">expected</span>: 12
 but got: 15
<span class="org-function-name">Cases</span>: 4  Tried: 4  Errors: 0  Failures: 1
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> References</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Official HUnit documentation: <a href="http://hackage.haskell.org/package/HUnit">HUnit: A unit testing framework for Haskell</a>
</li>

<li><a href="http://blog.ploeh.dk/2015/05/07/functional-design-is-intrinsically-testable/">Functional design is intrinsically testable</a>
</li>

<li><a href="http://www.seas.upenn.edu/~cis552/12fa/hw/hw1/">CIS 552: Advanced Programming- HW1 Haskell List Processing and recursion</a>
</li>

<li><a href="http://www.shakthimaan.com/posts/2015/10/09/testing/news.html">Shakthimaan's Blog | Introduction to Haskell - Testing</a>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: nobody</p>
<p class="date">Created: 2018-06-17 Sun 02:37</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
